# LightingSource Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RenderingSettings..::..LightingSource Property
RenderingSettings Class See Also
---
The lighting scheme type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public LightingSource LightingSource { get; set; }
```

Visual Basic
---
```text
Public Property LightingSource As LightingSource
	Get
	Set
```

Visual C++
---
```text
public:
property LightingSource LightingSource {
	LightingSource get ();
	void set (LightingSource value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
RenderingSettings Class
Autodesk.Revit.DB Namespace